Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Detached one- and two-family dwellings, their accessory structures and their associated sites and facilities are not required to comply with this chapter.
fr_ca: Les habitations individuelles et jumelées, leurs structures accessoires et leurs sites et installations associés ne sont pas tenus de se conformer au présent chapitre.

source: Directional exit signs shall be provided as specified in Section 1013.
fr_ca: Des panneaux de sortie directionnels doivent être prévus comme spécifié dans la section 1013.

source: Directional signage indicating the route to the nearest like accessible element shall be provided at the following locations.
fr_ca: Une signalisation directionnelle indiquant l'itinéraire vers l'élément accessible similaire le plus proche doit être fournie aux endroits suivants.

source: Discharge of interior exit stairways and ramps shall be provided with a free and unobstructed path of travel to an exterior exit door and such exit is readily visible and identifiable from the point of termination of the enclosure.
fr_ca: L’évacuation des escaliers et rampes d’issue intérieurs doit se faire par un parcours libre et sans obstruction jusqu’à une porte d’issue extérieure, et cette issue doit être facilement visible et identifiable depuis le point où l’enceinte prend fin.

source: Discharge of interior exit stairways through an atrium shall be in accordance with Section 1028.
fr_ca: L’issue d’évacuation des escaliers d’issue intérieurs à travers un atrium doit être conforme à l’article 1028.

source: Distance between corresponding dots from one cell directly below1
fr_ca: Distance entre les points correspondants d'une cellule directement en dessous 1

source: Distance between corresponding dots in adjacent cells1
fr_ca: Distance entre les points correspondants dans les cellules adjacentes 1

source: Distance between two dots in the same cell
fr_ca: Distance entre deux points dans la même cellule

source: Distance from top of opening to throat
fr_ca: Distance entre le haut de l'ouverture et la gueule

source: Distances between adjacent flues
fr_ca: Distances entre les conduits de fumée adjacents

source: Documentation of the gas detection system design and equipment to be used that demonstrates compliance with the requirements of this code and the International Fire Code shall be provided with the application for permit.
fr_ca: La documentation relative à la conception du système de détection de gaz et aux équipements à utiliser, démontrant la conformité aux exigences du présent code et de l’International Fire Code, doit être fournie avec la demande de permis.

source: Documents for deferred submittal items shall be submitted to the registered design professional in responsible charge who shall review them and forward them to the building official with a notation indicating that the deferred submittal documents have been reviewed and found to be in general conformance to the design of the building.
fr_ca: LLes documents relatifs aux éléments à soumettre ultérieurement doivent être remis au professionnel de la conception enregistré responsable, qui doit les examiner et les transmettre au responsable de la construction, accompagnés d’une mention indiquant que les documents relatifs aux éléments à soumettre ultérieurement ont été examinés et jugés généralement conformes à la conception du bâtiment.

source: Does not connect more than two stories.
fr_ca: Ne relie pas plus de deux étages.

source: Does not penetrate a horizontal assembly that separates fire areas or smoke barriers that separate smoke compartments.
fr_ca: Ne pénètre pas dans un ensemble horizontal qui sépare les zones d'incendie ou les barrières pare-fumée qui séparent les compartiments pare-fumée.

source: Domestic cooking appliances for use by residents of Group R-2 college dormitories shall be in accordance with Sections 420.11.1 and 420.11.2.
fr_ca: Les appareils de cuisson domestiques destinés à être utilisés par les résidents des dortoirs universitaires du groupe R-2 doivent être conformes aux sections 420.11.1 et 420.11.2.

source: Domestic cooking appliances shall be limited to approved locations.
fr_ca: Les appareils de cuisson domestiques doivent être limités aux endroits approuvés.

source: Domestic cooking hoods installed and constructed in accordance with Section 505 of the International Mechanical Code shall be provided over cooktops or ranges.
fr_ca: Des hottes de cuisine domestique installées et construites selon la section 505 de l'International Mechanical Code doivent être prévues au-dessus des tables de cuisson ou des cuisinières.

source: Door hardware shall be marked with not less than 16 square inches (10323 mm2) of luminous material.
fr_ca: La quincaillerie de porte doit être marquée avec au moins 16 pouces carrés (10 323 mm2) de matériau luminescent.

source: Doors and doorways shall comply with Section 1104.5.
fr_ca: Les portes et les ouvertures de porte doivent être conformes à la section 1104.5.

source: Doors and doorways shall comply with Section 1105.5.3
fr_ca: Les portes et les ouvertures de porte doivent être conformes à la section 1105.5.3

source: Doors in a bathtub enclosure shall conform to ASME A112.19.15.
fr_ca: Les portes d'une cabine de baignoire doivent être conformes à la norme ASME A112.19.15.

source: Doors in smoke partitions shall comply with Sections 710.5.2.1 through 710.5.2.3.
fr_ca: Les portes des cloisons pare-fumée doivent être conformes aux sections 710.5.2.1 à 710.5.2.3.

source: Doors in smoke partitions shall not include louvers.
fr_ca: Les portes des cloisons pare-fumée ne doivent pas comporter de persiennes.

source: Doors located on the long side shall provide a clear opening width of 42 inches (1065 mm) minimum and be located as far as practicable from the door on the narrow end.
fr_ca: Les portes situées sur le côté long doivent fournir une largeur d'ouverture libre minimale de 42 po [1065 mm] et être situées aussi loin que possible de la porte située sur l'extrémité étroite.

source: Doors located on the narrow end of cars shall provide a clear opening width of 36 inches (915 mm) minimum.
fr_ca: Les portes situées à l'extrémité étroite des cabines doivent offrir une largeur d'ouverture libre minimale de 36 po [915 mm].

source: Doors opening onto a landing shall not reduce the clear width to less than 42 inches (1067 mm).
fr_ca: Les portes donnant sur un palier ne doivent pas réduire la largeur libre à moins de 42 po (1067 mm).

source: Doors other than the required egress door shall be provided with landings or floors not more than 73/4 inches (196 mm) below the top of the threshold.
fr_ca: Les portes autres que la porte d'évacuation exigée doivent être munies de paliers ou de planchers situés à un maximum de 73/4 po [196 mm] au-dessous du dessus du seuil.

source: Doors shall not swing into the clear floor space or clearance for any fixture.
fr_ca: Les portes ne doivent pas s’ouvrir dans l’espace libre au sol ni dans le dégagement exigé pour tout appareil sanitaire.

source: Doors shall not swing into the clear floor space required by Section 903.2.
fr_ca: Les portes ne doivent pas s'ouvrir dans la surface de plancher dégagée exigée par la section 903.2.

source: Doors shall not swing into the room unless a clear floor space complying with Section 305.3 is provided within the room, beyond the arc of the door swing.
fr_ca: Les portes ne doivent pas s'ouvrir vers l'intérieur de la pièce, sauf si une surface de plancher dégagée conforme à l'article 305.3 est prévue dans la pièce, au-delà de l'arc d'ouverture de la porte.

source: Doors shall provide a clear opening width of 32 inches (815 mm) minimum.
fr_ca: Les portes doivent offrir une largeur d'ouverture libre minimale de 32 po [815 mm].

source: Doors shall remain open for 20 seconds minimum.
fr_ca: Les portes doivent demeurer ouvertes pendant au moins 20 secondes.

source: Doors that are part of a shower door assembly shall not be required to comply with this section.
fr_ca: Les portes qui font partie d'un ensemble de porte de douche ne sont pas tenues de se conformer à la présente section.

source: Doors through which occupants must pass in order to complete the exit path shall be provided with markings complying with Sections 1025.2.6.1 through 1025.2.6.3.
fr_ca: Les portes par lesquelles les occupants doivent passer pour compléter le chemin d'évacuation doivent être munies de marquages conformes aux articles 1025.2.6.1 à 1025.2.6.3.

source: Doors within a whirlpool enclosure shall conform to ASME A112.19.15.
fr_ca: Les portes à l'intérieur d'une enceinte de bain à remous doivent être conformes à la norme ASME A112.19.15.

source: Doorways intended for user passage shall comply with Section 1104.5.2.
fr_ca: Les ouvertures de porte destinées au passage des utilisateurs doivent être conformes à la section 1104.5.2.

source: Doorways shall have a clear opening of 313/4 inches (805 mm) minimum.
fr_ca: Les ouvertures de porte doivent avoir une ouverture libre d'au moins 313/4 po [805 mm].

source: Doorways, door-side windows that extend to the floor, and similar openings shall not be considered as wall space.
fr_ca: Les portes, les fenêtres situées du côté de la porte qui se prolongent jusqu'au sol et les ouvertures similaires ne doivent pas être considérées comme des espaces muraux.

source: Dormitories
fr_ca: Dortoirs

source: Dot base diameter
fr_ca: Diamètre de la base de point

source: Dot height
fr_ca: Hauteur du point

source: Dressing and appurtenant rooms shall comply with Sections 410.4.1 and 410.4.2.
fr_ca: Les vestiaires et les pièces annexes doivent être conformes aux sections 410.4.1 et 410.4.2.

source: Dressing rooms, scene docks, property rooms, workshops, storerooms and compartments appurtenant to the stage shall be separated from each other by not less than 1-hour fire barriers constructed in accordance with Section 707 or horizontal assemblies constructed in accordance with Section 711, or both.
fr_ca: Les loges, les quais de scène, les locaux à accessoires, les ateliers, les réserves et les locaux annexes à la scène doivent être séparés les uns des autres par des séparations coupe-feu d’au moins 1 heure construites conformément à la section 707 ou par des assemblages horizontaux construits conformément à la section 711, ou par les deux.

source: Dressing, fitting and locker rooms shall comply with Section 803.
fr_ca: Les vestiaires, les cabines d'essayage et les vestiaires avec casiers doivent être conformes à la section 803.

source: Ducts where the largest cross-sectional diameter of the duct is less than 10 inches (254 mm).
fr_ca: Les gaines dont le plus grand diamètre de la section transversale est inférieur à 10 pouces (254 mm).

source: Durable distinctive warning markings required by the adopted building code or ANSI safety standard.
fr_ca: Marquages d'avertissement distinctifs durables requis par le code du bâtiment adopté ou la norme de sécurité ANSI.

source: Dwelling units and sleeping units required by the scoping provisions adopted by the administrative authority to be Accessible units, Type A units, Type B units, Type C (Visitable) units or units with accessible communication features shall comply with the applicable provisions of Chapter 11.
fr_ca: Les unités d'habitation et les unités de couchage qui, en vertu des dispositions de délimitation du champ d'application adoptées par l'autorité administrative, doivent être des unités accessibles, des unités de type A, des unités de type B, des unités de type C (visitable) ou des unités dotées de dispositifs de communication accessibles, doivent être conformes aux dispositions applicables du chapitre 11.

source: Dwelling units and sleeping units that are required to be Accessible units, Type A units and Type B units shall comply with the applicable portions of Chapter 11 of ICC A117.1.
fr_ca: Les logements et les unités de couchage qui doivent être des unités accessibles, des unités de type A et des unités de type B doivent être conformes aux parties applicables du chapitre 11 de la norme ICC A117.1.

source: Dwelling units and sleeping units.
fr_ca: Unités d’habitation et chambres.

source: Dwellings shall be provided with a means of egress in accordance with this section.
fr_ca: Les logements doivent être munis de moyens d'évacuation conformément à la présente section.

source: E3902.11 Boathouse receptacles.
fr_ca: E3902.11 Prises de courant dans les hangars à bateaux.

source: EXPOSED SURFACE AREAOF ONE SIDE OF ONE LITE
fr_ca: SURFACE EXPOSÉE D'UN CÔTÉ D'UNE VITRE

source: EXPOSED SURFACEAREA OF ONE SIDEOF ONE LITE
fr_ca: SURFACE EXPOSÉE D'UN CÔTÉ D'UNE VITRE

source: Each assembly area required to comply with Section 1109.2.7 shall provide a sign notifying patrons of the availability of assistive listening systems.
fr_ca: Chaque espace d’assemblée tenu de respecter la section 1109.2.7 doit comporter un panneau informant les usagers de la disponibilité de systèmes d’aide à l’écoute.

source: Each car shall automatically stop at a floor landing within a tolerance of 1/2 inch (13 mm) under rated loading to zero loading conditions.
fr_ca: Chaque cabine doit s'arrêter automatiquement à un palier d'étage avec une tolérance de 1/2 po (13 mm) dans des conditions de charge nominale à charge nulle.

source: Each connection and the supply piping between the connection and the pumps shall be sized to supply the flow and pressure required for the pumps to operate.
fr_ca: Chaque raccordement et la tuyauterie d’alimentation entre le raccordement et les pompes doivent être dimensionnés de manière à fournir le débit et la pression nécessaires au fonctionnement des pompes.

source: Each designated aisle seat shall be identified by a sign or marker.
fr_ca: Chaque siège d'allée désigné doit être identifié par une enseigne ou un marqueur.

source: Each dwelling unit shall be provided with a kitchen area and every kitchen area shall be provided with a sink.
fr_ca: Chaque logement doit être doté d'une cuisine et chaque cuisine doit être dotée d'un évier.

source: Each end of an aisle shall be continuous to a cross aisle, foyer, doorway, vomitory, concourse or stairway in accordance with Section 1030.9.7 having access to an exit.
fr_ca: Chaque extrémité d'une allée doit être continue jusqu'à une allée transversale, un foyer, une ouverture de porte, un vestibule, un hall ou un escalier selon la section 1030.9.7 ayant accès à une issue.

source: Each fire service access elevator shall have a capacity of not less than 3,500 pounds (1588 kg) and shall comply with Section 3002.4.
fr_ca: Chaque ascenseur d’accès pour les services d’incendie doit avoir une capacité d’au moins 3 500 lb (1 588 kg) et doit être conforme à l’article 3002.4.

source: Each fixture provided shall comply with Section 1104.11.3.1.
fr_ca: Chaque appareil sanitaire prévu doit se conformer à la section 1104.11.3.1.

source: Each grab bar shall be 24 inches (610 mm) minimum in length, located 24 inches (610 mm) maximum from the head end wall and extend to 12 inches (305 mm) maximum from the control end wall.
fr_ca: Chaque barre d'appui doit avoir une longueur minimale de 24 po [610 mm], être située à une distance maximale de 24 po [610 mm] de la tête de mur et se prolonger jusqu'à une distance maximale de 12 po [305 mm] du mur de l'extrémité de commande.

source: Each grab bar shall be located 15 inches (380 mm) maximum from the head end wall and extend to 12 inches (305 mm) maximum from the control end wall.
fr_ca: Chaque barre d'appui doit être située à une distance maximale de 15 po [380 mm] de la tête de mur et se prolonger jusqu'à une distance maximale de 12 po [305 mm] du mur du côté des commandes.

source: Each pane of tempered glass, except tempered spandrel glass, shall be permanently identified by the manufacturer.
fr_ca: Chaque vitre en verre trempé, à l'exception du verre trempé pour tympan, doit être identifiée de façon permanente par le fabricant.

source: Each pane shall bear the manufacturer’s mark designating the type and thickness of the glass or glazing material.
fr_ca: Chaque vitre doit porter la marque du fabricant désignant le type et l'épaisseur du verre ou du matériau de vitrage.

source: Each riser shall supply sprinklers on alternate floors.
fr_ca: Chaque colonne montante doit alimenter les extincteurs d’un étage sur deux.

source: Each separate countertop space shall comply with the applicable requirements of this section.
fr_ca: Chaque espace de comptoir séparé doit être conforme aux exigences applicables du présent article.

source: Each sprinkler system zone in buildings that are more than 420 feet (128 m) in building height shall be supplied by not fewer than two risers.
fr_ca: Chaque zone de système d'extincteurs dans les bâtiments de plus de 420 pieds (128 m) de hauteur doit être alimentée par au moins deux colonnes montantes.

source: Each strap shall be fastened to not less than four floor ceiling or floor joists or rafters with two 1/2-inch (12.7 mm) bolts.
fr_ca: Chaque sangle doit être fixée à au moins quatre solives de plancher ou de plafond ou chevrons avec deux boulons de 1/2 pouce (12,7 mm).

source: Each urinal utilized by the public or employees shall occupy a separate area with walls or partitions to provide privacy.
fr_ca: Chaque urinoir utilisé par le public ou les employés doit occuper une zone séparée par des murs ou des cloisons pour assurer l'intimité.

source: Each vertical opening shall comply in accordance with one of the protection methods in Sections 712.1.1 through 712.1.16.
fr_ca: Chaque ouverture verticale doit être conforme à l'une des méthodes de protection décrites dans les sections 712.1.1 à 712.1.16.

source: Each water closet utilized by the public or employees shall occupy a separate compartment with walls or partitions and a door enclosing the fixtures to ensure privacy.
fr_ca: Chaque cabine de toilette utilisée par le public ou les employés doit occuper un compartiment séparé par des murs ou des cloisons et une porte pour assurer l'intimité.

source: Easily identifiable, manually operable windows or panels shall be distributed around the perimeter of each floor at not more than 50-foot (15 240 mm) intervals.
fr_ca: Des fenêtres ou des panneaux facilement identifiables et pouvant être ouverts manuellement doivent être répartis sur le pourtour de chaque étage à des intervalles ne dépassant pas 50 pi (15 240 mm).

source: Edge protection complying with Section 1012.10.1 or 1012.10.2 shall be provided on each side of ramp runs and at each side of ramp landings.
fr_ca: Une protection de bord conforme à la section 1012.10.1 ou 1012.10.2 doit être prévue de chaque côté des rampes et de chaque côté des paliers de rampe.

source: Edge protection complying with Section 405.9.1 or 405.9.2 shall be provided on each side of ramp runs and at each side of ramp landings.
fr_ca: Une protection de bord conforme à la section 405.9.1 ou 405.9.2 doit être prévue de chaque côté des rampes et de chaque côté des paliers de rampe.

source: Edge protection shall not be required on ramps not required to have handrails and that have flared sides complying with Section 406.3.
fr_ca: Une protection de bord n'est pas exigée sur les rampes qui ne sont pas tenues d'avoir des rampes et dont les côtés évasés sont conformes à l'article 406.3.

source: Edge protection shall not be required on the sides of ramp landings having a vertical drop-off of 1/2 inch (13 mm) maximum within 10 inches (255 mm) horizontally of the minimum landing area specified in Section 405.7.
fr_ca: Une protection de bord n'est pas exigée sur les côtés des paliers de rampe ayant une dénivellation verticale d'au plus 1/2 po [13 mm] à moins de 10 po [255 mm] horizontalement de la zone minimale du palier spécifiée à l'article 405.7.

source: Edge protection shall not be required on the sides of ramp landings serving an adjoining ramp run or stairway.
fr_ca: Une protection de bord n'est pas exigée sur les côtés des paliers de rampe desservant une course de rampe ou un escalier adjacent.

source: Edge protection shall not be required on the sides of ramped aisles where the ramps provide access to the adjacent seats and aisle access ways.
fr_ca: La protection des bords n'est pas exigée sur les côtés des allées en rampe où les rampes donnent accès aux sièges adjacents et aux voies d'accès aux allées.

source: Edges shall be rounded.
fr_ca: Les arêtes doivent être arrondies.

source: Effective flue area (based on area of fireplace opening)
fr_ca: Aire effective du conduit de fumée (basée sur l'aire de l'ouverture du foyer)

source: Efficiency dwelling units shall conform to the requirements of the code except as modified herein:
fr_ca: Les logements de type studio doivent être conformes aux exigences du code, sauf dans les cas modifiés ci-après :

source: Egress courts serving Group R-3 and U occupancies shall be not less than 36 inches (914 mm) in width.
fr_ca: Les cours d'évacuation desservant les occupations des groupes R-3 et U doivent avoir une largeur d'au moins 36 po (914 mm).

source: Egress courts serving Group R-3.
fr_ca: Cours d'évacuation desservant le groupe R-3.

source: Egress courts serving an occupant load of less than 10.
fr_ca: Cours d'évacuation desservant une charge d'occupants inférieure à 10.

source: Egress courts serving as an exit discharge component in the means of egress system shall comply with the requirements in this section.
fr_ca: Les cours d'évacuation servant d'issue d'évacuation dans un moyen d'évacuation doivent être conformes aux exigences de la présente section.

source: Egress doors shall be readily openable from inside the dwelling without the use of a key or special knowledge or effort.
fr_ca: Les portes de sortie doivent pouvoir être ouvertes facilement de l'intérieur du logement sans l'utilisation d'une clé ou de connaissances ou d'efforts particuliers.

source: Egress from habitable levels including habitable attics and basements that are not provided with an egress door in accordance with Section R311.2 shall be by a ramp in accordance with Section R311.8 or a stairway in accordance with Section R311.7.
fr_ca: L'évacuation des niveaux habitables, y compris les greniers et les sous-sols habitables, qui ne sont pas pourvus d'une porte d'évacuation selon la section R311.2, doit se faire par une rampe selon la section R311.8 ou par un escalier selon la section R311.7.

source: Egress path markings shall be provided in interior exit stairways, interior exit ramps and exit passageways, in accordance with Sections 1025.2.1 through 1025.2.6.3.
fr_ca: Les marquages du chemin d’évacuation doivent être installés dans les escaliers et rampes d’issue intérieurs et les passages d’issue, conformément aux sections 1025.2.1 à 1025.2.6.3.

source: Either all toilet and bathing areas provided shall comply with Section 1104.11.3.1 (Option A), or one toilet and bathing area shall comply with Section 1104.11.3.2 (Option B).
fr_ca: Toutes les salles de toilettes et salles de bains prévues doivent être conformes à la section 1104.11.3.1 (option A), ou une salle de toilettes et salle de bains doit être conforme à la section 1104.11.3.2 (option B).

source: Electrically powered fire pumps.
fr_ca: Pompes à incendie électriques.

source: Electronic media documents are permitted to be submitted where approved by the building official.
fr_ca: Les documents sur support électronique peuvent être soumis lorsque le responsable de la construction les approuve.

source: Elements or structures enclosing the occupied roof areas shall not extend more than 48 inches (1220 mm) above the surface of the occupied roof.
fr_ca: Les éléments ou constructions qui délimitent les aires de toit occupé ne doivent pas s’élever à plus de 48 pouces (1 220 mm) au-dessus de la surface du toit occupé.
